<a href="https://colab.research.google.com/github/sahil301290/Python-for-Data-Science/blob/main/06_7_Pandas_Input_Output.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##Agenda

- CSV Files

- HTML Tables

- Excel Files

- SQL Databases

NOTE: 

The path of the dataset should be correctly given while using the file in Pandas. 

Also, make sure file is not password protected.

https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

In [1]:
import pandas as pd
import numpy as np

###CSV Files - Input and Output

In [2]:
!pwd

/content

In [3]:
!ls

output.csv  sample_data  sample.html  saveLab.xlsx  students.xlsx

In [4]:
import os
os.getcwd()

'/content'

In [5]:
df = pd.read_csv('sample_data/california_housing_train.csv')
#df = pd.read_csv('sample_data/california_housing_train.csv', header = None)

In [6]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [7]:
df = pd.read_csv('sample_data/california_housing_train.csv', index_col=0)

In [8]:
df = df.reset_index()
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [9]:
df.to_csv('output.csv', index = False)

In [10]:
new = pd.read_csv('output.csv')
new

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

###HTML Files - Input and Output

Websites present the tables using HTML table tags \<table>

Pandas can convert these \<table> into DataFrame

Web Scraping is not available on all websites. Using an API is more useful in that case.

Working on India National Cricket Team Wikipedia Page:

https://en.wikipedia.org/wiki/India_national_cricket_team

In [11]:
url = 'https://en.wikipedia.org/wiki/India_national_cricket_team'

In [12]:
tables = pd.read_html(url)
len(tables)

70

In [13]:
tables[11].head()

                                            Name  ...                                            S/N
  Test, ODI & T20I Captain and Top-order batsman  ... Test, ODI & T20I Captain and Top-order batsman
0                                    Virat Kohli  ...                                             18
1     Test Vice Captain and Middle-order batsman  ...     Test Vice Captain and Middle-order batsman
2                                 Ajinkya Rahane  ...                                              3
3    ODI & T20I Vice Captain and Opening batsman  ...    ODI & T20I Vice Captain and Opening batsman
4                                   Rohit Sharma  ...                                             45

[5 rows x 10 columns]

In [14]:
tables[11].columns

MultiIndex([(         'Name', ...),
            (          'Age', ...),
            ('Batting style', ...),
            ('Bowling style', ...),
            ('Domestic team', ...),
            (         'Zone', ...),
            (     'IPL Team', ...),
            (          'C/G', ...),
            (       'Format', ...),
            (          'S/N', ...)],
           )

In [15]:
Table1 = tables[32]
Table1

           Player  Runs  Average
0     Virat Kohli  3159    52.65
1    Rohit Sharma  2864    32.54
2  Shikhar Dhawan  1673    27.88
3        MS Dhoni  1617    37.60
4    Suresh Raina  1605    29.18
5        KL Rahul  1557    39.92
6    Yuvraj Singh  1177    28.02
7  Gautam Gambhir   932    27.41
8   Manish Pandey   709    44.31
9    Shreyas Iyer   550    28.94

In [16]:
Table2 = tables[33]
Table2

                Player  Wickets  Average
0     Yuzvendra Chahal       62    25.40
1       Jasprit Bumrah       59    20.25
2  Ravichandran Ashwin       52    22.94
3    Bhuvneshwar Kumar       45    26.73
4        Hardik Pandya       41    26.68
5        Kuldeep Yadav       39    13.76
6      Ravindra Jadeja       39    29.53

In [17]:
#Saving Table1 into HTML file
Table1.to_html('sample.html', index = False)

###Excel Files - Input and Output

Pandas can only read raw data.

If there are visualizations, macros, or formulas in the excel file, they cannot be read as it is.

Pandas treats an Excel Workbook as a dictionary, with the key being the Sheet Name and the value being the DataFrame.

In [18]:
#import xlrd as xls
#import openpyxl as xlsx

In [19]:
df = pd.read_excel('students.xlsx')
df

   S. No. Name  TheoryMarks(60)
0       1    Q               45
1       2    W               46
2       3    E               47
3       4    R               48
4       5    T               49
5       6    Y               50

In [20]:
wb = pd.ExcelFile('students.xlsx')
wb.sheet_names

['TheoryMarksSheet', 'LabMarksSheet']

In [21]:
excel_sheet_dict = pd.read_excel('students.xlsx', sheet_name = None)

In [22]:
type(excel_sheet_dict)

dict

In [23]:
excel_sheet_dict.keys()

dict_keys(['TheoryMarksSheet', 'LabMarksSheet'])

In [24]:
excel_sheet_dict

{'LabMarksSheet':    S. No. Name  LabMarks (40)
 0       1    Q             34
 1       2    W             35
 2       3    E             36
 3       4    R             37
 4       5    T             38
 5       6    Y             39,
 'TheoryMarksSheet':    S. No. Name  TheoryMarks(60)
 0       1    Q               45
 1       2    W               46
 2       3    E               47
 3       4    R               48
 4       5    T               49
 5       6    Y               50}

In [25]:
df_Save = excel_sheet_dict['LabMarksSheet']

In [26]:
df_Save.to_excel('saveLab.xlsx', index = False)

###SQL Databases - Input and Output

Pandas can read and write to various SQL engines through the use of a driver and the sqlalchemy python library

Various SQL engines being MySQL, PostgreSQL, Microsoft SQL Server etc.

Steps:

1. Python Driver Libraries needed for various SQL engines:
- MySQL - pymysql
- PostgreSQL - psycopg2
- MS SQL Server - pyodbc

2. Use the sqlalchemy library to connect to SQL database with the driver.

  https://docs.sqlalchemy.org/en/14/dialects/index.html

3. Use the sqlalchemy driver connection with pandas read_sql method.

Useful links:
1. How-to: Run SQL data queries with pandas (Oracle SQL + Pandas)

  https://www.oracle.com/news/connect/run-sql-data-queries-with-pandas.html#:~:text=How-to%3A%20Run%20SQL%20data%20queries%20with%20pandas%201,...%207%20Conclusion.%20...%208%20Dig%20deeper.%20

2. Pandas DataFrames - Writing To And Reading From MySQL Table (MySQL + Pandas)

  https://www.oracle.com/news/connect/run-sql-data-queries-with-pandas.html#:~:text=How-to%3A%20Run%20SQL%20data%20queries%20with%20pandas%201,...%207%20Conclusion.%20...%208%20Dig%20deeper.%20

3. Use pandas to Visualize Google Sheets Data in Python (gsheets + Pandas)

  https://www.cdata.com/kb/tech/gsheets-python-pandas.rst

SQLite comes with Python

In [27]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/dist-packages (1.4.18)
Requirement already satisfied: greenlet!=0.4.17; python_version >= "3" in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (1.1.0)
Requirement already satisfied: importlib-metadata; python_version < "3.8" in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (4.5.0)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata; python_version < "3.8"->sqlalchemy) (3.4.1)
Requirement already satisfied: typing-extensions>=3.6.4; python_version < "3.8" in /usr/local/lib/python3.7/dist-packages (from importlib-metadata; python_version < "3.8"->sqlalchemy) (3.7.4.3)

In [28]:
from sqlalchemy import create_engine

In [29]:
#Engine creation string code varies for different SQL Engines
temp_db = create_engine('sqlite:///:memory:')

In [30]:
df = pd.DataFrame(data = np.random.randint(low = 0, high = 100, size = (5,5)), columns = ['a', 'b', 'c', 'd', 'e'])
df

    a   b   c   d   e
0   5  84  71  63  15
1  50  47  12  71  80
2   7  88   2  92  97
3   1  28  29  49  16
4  58  22  95  83  93

In [31]:
df.to_sql(name = 'new_table', con = temp_db) #index = False

In [32]:
#df.to_sql(name = 'new_table', con = temp_db)

In [33]:
new_df = pd.read_sql(sql = 'new_table', con = temp_db)
new_df

   index   a   b   c   d   e
0      0   5  84  71  63  15
1      1  50  47  12  71  80
2      2   7  88   2  92  97
3      3   1  28  29  49  16
4      4  58  22  95  83  93

Running a SQL query

In [34]:
result = pd.read_sql_query(sql = 'SELECT a, d FROM new_table', con = temp_db)
result

    a   d
0   5  63
1  50  71
2   7  92
3   1  49
4  58  83

End of Code